In [1]:
import numpy as np
import pandas as pd

In [2]:
user = pd.DataFrame({'userid' : [1,2,3],'name' : ['A','B','C']})

In [3]:
user

   userid name
0       1    A
1       2    B
2       3    C

In [5]:
msg = pd.DataFrame({'id':[1,1,2],'msg' : ['bye','hello','hi']})

In [6]:
msg

   id    msg
0   1    bye
1   1  hello
2   2     hi

In [8]:
user = pd.read_csv('msg.csv')

In [9]:
user

   id    msg
0   1  hello
1   1    bye
2   2     hi

In [10]:
user = pd.read_csv('user.csv')

In [11]:
user

   userid name
0       1    A
1       2    B
2       3    C

In [12]:
pd.concat([user,msg])

   userid name   id    msg
0     1.0    A  NaN    NaN
1     2.0    B  NaN    NaN
2     3.0    C  NaN    NaN
0     NaN  NaN  1.0    bye
1     NaN  NaN  1.0  hello
2     NaN  NaN  2.0     hi

In [13]:
pd.concat([msg,user])

    id    msg  userid name
0  1.0    bye     NaN  NaN
1  1.0  hello     NaN  NaN
2  2.0     hi     NaN  NaN
0  NaN    NaN     1.0    A
1  NaN    NaN     2.0    B
2  NaN    NaN     3.0    C

In [14]:
pd.concat([user,msg],axis=1)

   userid name  id    msg
0       1    A   1    bye
1       2    B   1  hello
2       3    C   2     hi

In [15]:
# merge

In [18]:
msg.merge(user,left_on='id',right_on='userid')

   id    msg  userid name
0   1    bye       1    A
1   1  hello       1    A
2   2     hi       2    B

In [19]:
msg

   id    msg
0   1    bye
1   1  hello
2   2     hi

In [20]:
user

   userid name
0       1    A
1       2    B
2       3    C

In [21]:
msg.merge(user,left_on='id',right_on='userid',how='outer')

    id    msg  userid name
0  1.0    bye       1    A
1  1.0  hello       1    A
2  2.0     hi       2    B
3  NaN    NaN       3    C

In [22]:
msg.merge(user,left_on='id',right_on='userid',how='left')

   id    msg  userid name
0   1    bye       1    A
1   1  hello       1    A
2   2     hi       2    B

In [23]:
msg.merge(user,left_on='id',right_on='userid',how='right')

    id    msg  userid name
0  1.0    bye       1    A
1  1.0  hello       1    A
2  2.0     hi       2    B
3  NaN    NaN       3    C